{"backend": "tensorflow", "keras_version": "2.1.2", "config": [{"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "name": "conv2d_1", "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 2], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "filters": 32, "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 2], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "filters": 64, "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "filters": 64, "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 256, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "units": 1, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential"}